{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First off, I think this is the type of content &lt;a href=\"/r/entrepreneur\"&gt;/r/entrepreneur&lt;/a&gt; needs. If you found value in it; please upvote and get involved in the comments.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Intro&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I am Eric Bandholz, founder of &lt;a href=\"http://www.beardbrand.com\"&gt;Beardbrand&lt;/a&gt;, and we build and sell beard care products; as well as other items for the bearded lifestyle. Our tagline is that &amp;quot;We foster style for the urban beardsman.&amp;quot; Many startup companies focus on selling their products, but they neglect building their brand. While simply selling is difficult, it&amp;#39;s still easier than creating a brand. This guide shows how we are building a brand with Beardbrand and what you should focus on. Keep in mind that not all businesses need to build a brand, but if you are B2C company it should be a pretty high priority.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Advantages of building a brand&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Customers will be more loyal&lt;/li&gt;\n&lt;li&gt;Your products can carry a higher price point&lt;/li&gt;\n&lt;li&gt;Word of mouth marketing / viral marketing is more common&lt;/li&gt;\n&lt;li&gt;Valuation of your company will be higher (One example: the US company Electrolux sold their brand and nothing else to the Sweedish Electrolux. Their new brand is now known as &lt;a href=\"http://en.wikipedia.org/wiki/Aerus_LLC\"&gt;Aerus&lt;/a&gt;.)&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;Disadvantages of building a brand&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;It&amp;#39;s more expensive&lt;/li&gt;\n&lt;li&gt;It&amp;#39;s a longer strategy&lt;/li&gt;\n&lt;li&gt;Must invest in more company culture to ensure brand is not tarnished&lt;/li&gt;\n&lt;li&gt;Return on investment is not as clear as call to action marketing&lt;/li&gt;\n&lt;li&gt;A tarnished brand loses all the hardwork you&amp;#39;ve done to build it up&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;The Start&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;First you will want to commit to building a brand, and all the challenges that presents. You will have to be prepared to say &amp;quot;no&amp;quot; and stick to your guns. Inconsistency is the death to brands. Spend a lot of time up front to truly understand what you want to be and how you want to present your company.&lt;/p&gt;\n\n&lt;p&gt;With Beardbrand we developed the term &amp;quot;urban beardsman&amp;quot; which describes a man with a beard who cares about their style, their grooming habits, and who has a plan and a vision with their personal life. Traditionally beardsmen were thought of as hippies, bikers, outdoorsmen, or homeless folks. We wanted to unite people who didn&amp;#39;t feel like they fit those labels. &lt;/p&gt;\n\n&lt;p&gt;To get this rolling we place an emphasis on design and branding. Our logo is simple and clean. Our primary colors are black and white and secondary color is cyan. We have had our tagline front and center on our store since we created it. Fortunately, I am a self taught designer and have implemented a lot of our designs. If you do not have those skills, you will need to invest in a quality designer. Most likely you won&amp;#39;t find those at Fiverr, 99 designs, or any of those spec work places. Try instead to search for them via Dribbble, &lt;a href=\"/r/graphic_design\"&gt;/r/graphic_design&lt;/a&gt;, your local AIGA club, or other places designers like to hang out.&lt;/p&gt;\n\n&lt;p&gt;Plan on establishing a relationship with a designer you can trust and work with. You&amp;#39;ll want to send all (or at least a majority of) your designs to them so that you create brand consistency. All designers have different styles, and like I said before; inconsistency a roadblock to building a quality brand. A good designer can also help you with brand guidelines to keep you and others on track. It&amp;#39;s essentially a blueprint on how to keep things consistent.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Build&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;First off, it&amp;#39;s important that you walk the walk. IE; the image you are trying to create of your brand is something you actually eat, drink, sleep and live. You&amp;#39;ll want to tie together your branding across all your channels. That means your actions, business cards, website, merchandise, advertisements, emails, marketing, etc must all be cohesive. To show you how we did it, here are a few elements Beardbrand has created.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=\"http://www.beardbrand.com\"&gt;Website&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://www.beardbrand.com/pages/beardbrand-vision\"&gt;Our Vision Page&lt;/a&gt; *very important for us&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"https://www.youtube.com/watch?v=3eKg9GdDpQY\"&gt;Video of our vision&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://i.imgur.com/LbQstD4.jpg\"&gt;One of our ads&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://dribbble.com/shots/1103944-Beardbrand-business-cards?list=show\"&gt;Business Cards&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://instagram.com/p/kiUhjVMYAq/\"&gt;PR Kit&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://i.imgur.com/9NTzzUe.jpg\"&gt;Mustache Wax Packaging&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;&lt;a href=\"http://i.imgur.com/3dLIedD.jpg\"&gt;Beard Oil Packaging&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;In addition to your brand&amp;#39;s design and feel, your company also has a brand on how it performs. Based on our target audience, we decided to provide a premium experience to our customers. To us that means quality products, fast shipping, no hassle customer service, and no sales pressure. How this reflects on our business is that we are using premium oils that put beard care first, quality packaging, shipping within one business day, making things right with customers when things go wrong, and offer no discounts or sales on our store.&lt;/p&gt;\n\n&lt;p&gt;When we attend events, trade shows, or put on parties - then we carry the same attitude and image that we portray online. We try to be as friendly as possible, not pressure anyone into anything, and have a good time. There is more to life than just selling beard products.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;The Sacrifices&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;We frequently get suggestions to do things differently. We are always have open ears (in fact made a lot of changes based on Reddit&amp;#39;s friendly advice) but sometimes we&amp;#39;ve got to say &amp;quot;no&amp;quot; and do it for the right reason (or at least you think they are right). Here are a couple of examples.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;I&amp;#39;ve had multiple marketing professionals tell us that we need to put our products on sale. I stand by our viewpoint that our product is fantastic, and when people are ready to buy they will buy. Granted, we might be missing out on some opportunity; but we feel in the long run we prefer the culture of quality over immediate gratification. We use Nordstrom&amp;#39;s and Lululemon as inspiration.&lt;/li&gt;\n&lt;li&gt;We don&amp;#39;t put advertisements on our YouTube videos. We are approaching 1 million views and I&amp;#39;m sure I could have had a few thousand extra dollars, but it&amp;#39;s a more pleasureable experience not watching ads when people watch our videos.&lt;/li&gt;\n&lt;li&gt;We stick to style inspiration on Facebook. In a land of 10 day old internet memes, we could exponentially grow our user base by simply posting beard meme&amp;#39;s. While, it may slow us down in growth; it&amp;#39;s more important for us to accurately show we are about. &lt;/li&gt;\n&lt;li&gt;We market with no direct performance tracking. Some examples: We are putting a party on down in SXSW called &lt;a href=\"https://www.facebook.com/events/1427271914180622\"&gt;SXBB&lt;/a&gt;. | We are buying ads that simply have photos of beardsmen and no call to action. | We are building an Ambassador program where we give out freebies to the select few beardsmen who really represent the image well. | Plus many other things.&lt;/li&gt;\n&lt;li&gt;We&amp;#39;ve spent way more on business cards, PR kits, and other items than your typical company&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;The Results&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;In less than a year we went from $0 in sales to $120k/month in sales. &lt;/li&gt;\n&lt;li&gt;We have a higher repeat customer rate than industry average&lt;/li&gt;\n&lt;li&gt;Our 7k email list gets 46.6% open rate and 13% click rate&lt;/li&gt;\n&lt;li&gt;Our users gladly write reviews of their experiences and share it on social media&lt;/li&gt;\n&lt;li&gt;Customers will tell us that they purchase from us because of our videos and our vision&lt;/li&gt;\n&lt;li&gt;Building our business is a very pleasant and enjoyable experience&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Ultimately, I tried to cover everything, but I&amp;#39;m sure I missed a lot. Feel free to ask questions in the comments and I&amp;#39;ll answer them to the best of my ability.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; Building a brand is hard work but doable; this is how we are doing it. Most important thing; be consistent and be the company that you present yourself as.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First off, I think this is the type of content /r/entrepreneur needs. If you found value in it; please upvote and get involved in the comments.\n\n**Intro**\n\nI am Eric Bandholz, founder of [Beardbrand](http://www.beardbrand.com), and we build and sell beard care products; as well as other items for the bearded lifestyle. Our tagline is that \"We foster style for the urban beardsman.\" Many startup companies focus on selling their products, but they neglect building their brand. While simply selling is difficult, it's still easier than creating a brand. This guide shows how we are building a brand with Beardbrand and what you should focus on. Keep in mind that not all businesses need to build a brand, but if you are B2C company it should be a pretty high priority.\n\n**Advantages of building a brand**\n\n* Customers will be more loyal\n* Your products can carry a higher price point\n* Word of mouth marketing / viral marketing is more common\n* Valuation of your company will be higher (One example: the US company Electrolux sold their brand and nothing else to the Sweedish Electrolux. Their new brand is now known as [Aerus](http://en.wikipedia.org/wiki/Aerus_LLC).)\n\n**Disadvantages of building a brand**\n\n* It's more expensive\n* It's a longer strategy\n* Must invest in more company culture to ensure brand is not tarnished\n* Return on investment is not as clear as call to action marketing\n* A tarnished brand loses all the hardwork you've done to build it up\n\n**The Start**\n\nFirst you will want to commit to building a brand, and all the challenges that presents. You will have to be prepared to say \"no\" and stick to your guns. Inconsistency is the death to brands. Spend a lot of time up front to truly understand what you want to be and how you want to present your company.\n\nWith Beardbrand we developed the term \"urban beardsman\" which describes a man with a beard who cares about their style, their grooming habits, and who has a plan and a vision with their personal life. Traditionally beardsmen were thought of as hippies, bikers, outdoorsmen, or homeless folks. We wanted to unite people who didn't feel like they fit those labels. \n\nTo get this rolling we place an emphasis on design and branding. Our logo is simple and clean. Our primary colors are black and white and secondary color is cyan. We have had our tagline front and center on our store since we created it. Fortunately, I am a self taught designer and have implemented a lot of our designs. If you do not have those skills, you will need to invest in a quality designer. Most likely you won't find those at Fiverr, 99 designs, or any of those spec work places. Try instead to search for them via Dribbble, /r/graphic_design, your local AIGA club, or other places designers like to hang out.\n\nPlan on establishing a relationship with a designer you can trust and work with. You'll want to send all (or at least a majority of) your designs to them so that you create brand consistency. All designers have different styles, and like I said before; inconsistency a roadblock to building a quality brand. A good designer can also help you with brand guidelines to keep you and others on track. It's essentially a blueprint on how to keep things consistent.\n\n**The Build**\n\nFirst off, it's important that you walk the walk. IE; the image you are trying to create of your brand is something you actually eat, drink, sleep and live. You'll want to tie together your branding across all your channels. That means your actions, business cards, website, merchandise, advertisements, emails, marketing, etc must all be cohesive. To show you how we did it, here are a few elements Beardbrand has created.\n\n* [Website](http://www.beardbrand.com)\n* [Our Vision Page](http://www.beardbrand.com/pages/beardbrand-vision) *very important for us\n* [Video of our vision](https://www.youtube.com/watch?v=3eKg9GdDpQY)\n* [One of our ads](http://i.imgur.com/LbQstD4.jpg)\n* [Business Cards](http://dribbble.com/shots/1103944-Beardbrand-business-cards?list=show)\n* [PR Kit](http://instagram.com/p/kiUhjVMYAq/)\n* [Mustache Wax Packaging](http://i.imgur.com/9NTzzUe.jpg)\n* [Beard Oil Packaging](http://i.imgur.com/3dLIedD.jpg)\n\nIn addition to your brand's design and feel, your company also has a brand on how it performs. Based on our target audience, we decided to provide a premium experience to our customers. To us that means quality products, fast shipping, no hassle customer service, and no sales pressure. How this reflects on our business is that we are using premium oils that put beard care first, quality packaging, shipping within one business day, making things right with customers when things go wrong, and offer no discounts or sales on our store.\n\nWhen we attend events, trade shows, or put on parties - then we carry the same attitude and image that we portray online. We try to be as friendly as possible, not pressure anyone into anything, and have a good time. There is more to life than just selling beard products.\n\n**The Sacrifices**\n\nWe frequently get suggestions to do things differently. We are always have open ears (in fact made a lot of changes based on Reddit's friendly advice) but sometimes we've got to say \"no\" and do it for the right reason (or at least you think they are right). Here are a couple of examples.\n\n* I've had multiple marketing professionals tell us that we need to put our products on sale. I stand by our viewpoint that our product is fantastic, and when people are ready to buy they will buy. Granted, we might be missing out on some opportunity; but we feel in the long run we prefer the culture of quality over immediate gratification. We use Nordstrom's and Lululemon as inspiration.\n* We don't put advertisements on our YouTube videos. We are approaching 1 million views and I'm sure I could have had a few thousand extra dollars, but it's a more pleasureable experience not watching ads when people watch our videos.\n* We stick to style inspiration on Facebook. In a land of 10 day old internet memes, we could exponentially grow our user base by simply posting beard meme's. While, it may slow us down in growth; it's more important for us to accurately show we are about. \n* We market with no direct performance tracking. Some examples: We are putting a party on down in SXSW called [SXBB](https://www.facebook.com/events/1427271914180622). | We are buying ads that simply have photos of beardsmen and no call to action. | We are building an Ambassador program where we give out freebies to the select few beardsmen who really represent the image well. | Plus many other things.\n* We've spent way more on business cards, PR kits, and other items than your typical company\n\n**The Results**\n\n* In less than a year we went from $0 in sales to $120k/month in sales. \n* We have a higher repeat customer rate than industry average\n* Our 7k email list gets 46.6% open rate and 13% click rate\n* Our users gladly write reviews of their experiences and share it on social media\n* Customers will tell us that they purchase from us because of our videos and our vision\n* Building our business is a very pleasant and enjoyable experience\n\nUltimately, I tried to cover everything, but I'm sure I missed a lot. Feel free to ask questions in the comments and I'll answer them to the best of my ability.\n\n**TL;DR** Building a brand is hard work but doable; this is how we are doing it. Most important thing; be consistent and be the company that you present yourself as.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zmpvl", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "bandholz", "media": null, "score": 165, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 32, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zmpvl/beardbrands_guide_to_building_a_brand/", "name": "t3_1zmpvl", "created": 1394061942.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zmpvl/beardbrands_guide_to_building_a_brand/", "author_flair_text": null, "title": "Beardbrand's guide to building a brand", "created_utc": 1394033142.0, "ups": 197, "num_comments": 107, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TLDR&lt;/strong&gt; Found a popular supplement combination on &lt;a href=\"/r/nootropics\"&gt;/r/nootropics&lt;/a&gt; and made it into singular pill and branded it. We launched &lt;a href=\"http://greenteafocus.com/\"&gt;Green Tea Focus&lt;/a&gt; by making this &lt;a href=\"http://www.reddit.com/r/Nootropics/comments/1ngsjk/green_tea_focus_caffeine100mg_ltheanine200mg/\"&gt;post&lt;/a&gt;. To the few that make it through my short novel thank you.&lt;/p&gt;\n\n&lt;p&gt;For a long time I&amp;#39;ve wanted to start a business, and with frustration building up from university, I figured now would be the best time to start. I could potentially dropout if it became viable enough or just actually gain some real experience and learn something from the experience. I started by reading as many non-fiction books on business and marketing as I could, acquiring some library fees along the way. One book that really was the tipping point for me was The 4 Hour Workweek. It&amp;#39;s a little outdated but it provided for me a solid framework to start from. I learned that starting a health supplement company isn&amp;#39;t really as difficult as you would imagine, especially in the US. &lt;/p&gt;\n\n&lt;p&gt;To me, at least, the hardest part of starting a business is the doing part. To help motivate myself, I told as many people my plans to start a business so I felt compelled to produce results. I created a notebook using Evernote dedicated just for the business project I had in mind. It let me keep all my information organized, while at the same time, let me slowly chip away at reaching my goal.  &lt;/p&gt;\n\n&lt;p&gt;My first business idea was to create a supplement to increase your chance of lucid dreaming. While trying to make it, I ran into continuous problems that resulted in changes which made my business idea gradually worse. When I finally had to put money behind my idea, I couldn’t go through with it because I knew that business was shit. &lt;/p&gt;\n\n&lt;p&gt;Literally the same day I realized my idea was fruitless I stumbled on r/nootropics. Nootropics are basically supplements that improve mental performance. I had become semi familiar through products like Alpha Brain. I was also actually already using some supplements that I bought for lucid dreaming purposes to help improve my short term memory in preparation for tests. I read their FAQ and on it I discovered their most recommended stack which is 100 mg Caffeine and 200 mg of L-Theanine. The first thing I did was search to see if I could get it in a singular pill because I was too lazy to be buying the separate ingredients and encapsulate it myself. To my surprise, there were none, which I thought was weird. It was a perfect opportunity; it almost felt too convenient and obvious. There was even a post someone made on the subreddit basically asking if there was singular pill form that they could purchase. Seeing that there was a demand, I took the plunge and decided I would build it into a business.&lt;/p&gt;\n\n&lt;p&gt;As someone in their early 20s, in school, I&amp;#39;m not exactly rolling in cash. So getting a good manufacturer that could work within my budget was important. I contacted a lot of manufacturers. A lot of them just didn&amp;#39;t work out or just didn&amp;#39;t fit within my budget. I finally found a manufacturer that gave me a crazy good deal, this is because they already had both of the product supplements in stock and didn&amp;#39;t have to go out of their way to purchase them. One skill that I cannot stress saved me thousands of dollars were my graphic design skills. Because of it, I was able to do all the necessary artwork for both the physical product and for my website. Wordpress, Woocommerce, and Shipwire are the foundations to my business that make it run really nicely and make it possible that I can run my business from the comfort of my room. I cannot say enough nice things about these companies.&lt;/p&gt;\n\n&lt;p&gt;We officially launched in October on r/nootropics with this &lt;a href=\"http://www.reddit.com/r/Nootropics/comments/1ngsjk/green_tea_focus_caffeine100mg_ltheanine200mg/\"&gt;post&lt;/a&gt;. It was great because we were able to get tons of feedback to improve site, and finally get sales.Check us out &lt;a href=\"http://greenteafocus.com/\"&gt;Green Tea Focus&lt;/a&gt;. Feel free to ama or even give us some advice. Kenyudigit will be helping me answer questions, he is my business partner. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;edit&lt;/strong&gt; Thanks for all the great feedback, we&amp;#39;ll try our best to reply to all the comments. Someone commented about giving you guys a coupon and so if you&amp;#39;re thinking about trying it out use the &lt;strong&gt;coupon: kenyudigit&lt;/strong&gt; and you&amp;#39;ll get 10% off. The offer is limited to next 7 days.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "**TLDR** Found a popular supplement combination on /r/nootropics and made it into singular pill and branded it. We launched [Green Tea Focus](http://greenteafocus.com/) by making this [post](http://www.reddit.com/r/Nootropics/comments/1ngsjk/green_tea_focus_caffeine100mg_ltheanine200mg/). To the few that make it through my short novel thank you.\n\n    \n\nFor a long time I've wanted to start a business, and with frustration building up from university, I figured now would be the best time to start. I could potentially dropout if it became viable enough or just actually gain some real experience and learn something from the experience. I started by reading as many non-fiction books on business and marketing as I could, acquiring some library fees along the way. One book that really was the tipping point for me was The 4 Hour Workweek. It's a little outdated but it provided for me a solid framework to start from. I learned that starting a health supplement company isn't really as difficult as you would imagine, especially in the US. \n\nTo me, at least, the hardest part of starting a business is the doing part. To help motivate myself, I told as many people my plans to start a business so I felt compelled to produce results. I created a notebook using Evernote dedicated just for the business project I had in mind. It let me keep all my information organized, while at the same time, let me slowly chip away at reaching my goal.  \n\nMy first business idea was to create a supplement to increase your chance of lucid dreaming. While trying to make it, I ran into continuous problems that resulted in changes which made my business idea gradually worse. When I finally had to put money behind my idea, I couldn’t go through with it because I knew that business was shit. \n\nLiterally the same day I realized my idea was fruitless I stumbled on r/nootropics. Nootropics are basically supplements that improve mental performance. I had become semi familiar through products like Alpha Brain. I was also actually already using some supplements that I bought for lucid dreaming purposes to help improve my short term memory in preparation for tests. I read their FAQ and on it I discovered their most recommended stack which is 100 mg Caffeine and 200 mg of L-Theanine. The first thing I did was search to see if I could get it in a singular pill because I was too lazy to be buying the separate ingredients and encapsulate it myself. To my surprise, there were none, which I thought was weird. It was a perfect opportunity; it almost felt too convenient and obvious. There was even a post someone made on the subreddit basically asking if there was singular pill form that they could purchase. Seeing that there was a demand, I took the plunge and decided I would build it into a business.\n\nAs someone in their early 20s, in school, I'm not exactly rolling in cash. So getting a good manufacturer that could work within my budget was important. I contacted a lot of manufacturers. A lot of them just didn't work out or just didn't fit within my budget. I finally found a manufacturer that gave me a crazy good deal, this is because they already had both of the product supplements in stock and didn't have to go out of their way to purchase them. One skill that I cannot stress saved me thousands of dollars were my graphic design skills. Because of it, I was able to do all the necessary artwork for both the physical product and for my website. Wordpress, Woocommerce, and Shipwire are the foundations to my business that make it run really nicely and make it possible that I can run my business from the comfort of my room. I cannot say enough nice things about these companies.\n\nWe officially launched in October on r/nootropics with this [post](http://www.reddit.com/r/Nootropics/comments/1ngsjk/green_tea_focus_caffeine100mg_ltheanine200mg/). It was great because we were able to get tons of feedback to improve site, and finally get sales.Check us out [Green Tea Focus](http://greenteafocus.com/). Feel free to ama or even give us some advice. Kenyudigit will be helping me answer questions, he is my business partner. \n\n**edit** Thanks for all the great feedback, we'll try our best to reply to all the comments. Someone commented about giving you guys a coupon and so if you're thinking about trying it out use the **coupon: kenyudigit** and you'll get 10% off. The offer is limited to next 7 days.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zmfrm", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "henweigh", "media": null, "score": 127, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": 1394068833.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 19, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zmfrm/how_i_started_a_health_supplement_business_by/", "name": "t3_1zmfrm", "created": 1394054034.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zmfrm/how_i_started_a_health_supplement_business_by/", "author_flair_text": null, "title": "How I started a Health Supplement Business by Identifying an Opportunity within a subreddit", "created_utc": 1394025234.0, "ups": 146, "num_comments": 116, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So we built what we thought was a very useful tool for making sure important emails get answered. It lets you dispatch custom follow-up messages that bump the original email to the top of the inbox if you don&amp;#39;t get a response. Works great with clients, proposals, deadlines, you name it. It actually makes email a reliable form of important communication again by preventing important emails from falling through the cracks.&lt;/p&gt;\n\n&lt;p&gt;Two Techcrunch writers (did it really take two?) declared us a nightmarish tool for spammers with the headline: &amp;quot;&lt;a href=\"http://techcrunch.com/2014/02/28/meet-rebump-the-new-worst-thing-about-email/\"&gt;Meet Rebump - the New Worst Thing About Email&lt;/a&gt;.&amp;quot; The thing is, their entire presentation of the product&amp;#39;s uses is totally off. They didn&amp;#39;t bother getting in touch with us and didn&amp;#39;t even sign up to view the actual functionality of the product. They printed contradictory information about the most basic way the app works right in the article and ignored safeguards that we put in place to make Rebump a terrible choice for anyone looking to send spam. So two guys that hate email essentially used us as a straw-man prop for a (somewhat entertaining) rant about how email is the worst and we make it even more unbearable. Cue the pitchforks and Tweets advising us to euthanize ourselves and no amount of rational argument can extricate us from being the new face of the Spammers&amp;#39; arms race. You get the picture.&lt;/p&gt;\n\n&lt;p&gt;On a brighter note, the traffic boost was nice and conversion has been over 7% (!) and rising (particularly cool because it&amp;#39;s a multi-step process involving plugin installation and two Google authentications). We&amp;#39;ve added an FAQ that addresses the concerns about spammers, but could use some creative advice on next steps and reaching the right users.&lt;/p&gt;\n\n&lt;p&gt;Link: &lt;a href=\"http://Rebump.cc\"&gt;Rebump.cc&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So we built what we thought was a very useful tool for making sure important emails get answered. It lets you dispatch custom follow-up messages that bump the original email to the top of the inbox if you don't get a response. Works great with clients, proposals, deadlines, you name it. It actually makes email a reliable form of important communication again by preventing important emails from falling through the cracks.\n\nTwo Techcrunch writers (did it really take two?) declared us a nightmarish tool for spammers with the headline: \"[Meet Rebump - the New Worst Thing About Email](http://techcrunch.com/2014/02/28/meet-rebump-the-new-worst-thing-about-email/).\" The thing is, their entire presentation of the product's uses is totally off. They didn't bother getting in touch with us and didn't even sign up to view the actual functionality of the product. They printed contradictory information about the most basic way the app works right in the article and ignored safeguards that we put in place to make Rebump a terrible choice for anyone looking to send spam. So two guys that hate email essentially used us as a straw-man prop for a (somewhat entertaining) rant about how email is the worst and we make it even more unbearable. Cue the pitchforks and Tweets advising us to euthanize ourselves and no amount of rational argument can extricate us from being the new face of the Spammers' arms race. You get the picture.\n\nOn a brighter note, the traffic boost was nice and conversion has been over 7% (!) and rising (particularly cool because it's a multi-step process involving plugin installation and two Google authentications). We've added an FAQ that addresses the concerns about spammers, but could use some creative advice on next steps and reaching the right users.\n\nLink: [Rebump.cc](http://Rebump.cc)", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zncyh", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "stealyourfaceboo", "media": null, "score": 16, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zncyh/techcrunch_article_convinced_the_internet_we_are/", "name": "t3_1zncyh", "created": 1394075324.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zncyh/techcrunch_article_convinced_the_internet_we_are/", "author_flair_text": null, "title": "TechCrunch article convinced the Internet we are evil incarnate and handed out pitchforks. How do we allay these fears?", "created_utc": 1394046524.0, "ups": 20, "num_comments": 14, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t see it as actually feasible but curious if anyone has actually seen a business model like this.  I&amp;#39;m thinking of using this idea for an MBA project next term but curious on input.&lt;/p&gt;\n\n&lt;p&gt;Basic concept is I would own a work shop (wood and metal, maybe a mechanic&amp;#39;s bay too?) and charge for time in the shop.  Have all the tools and machines and whatnot.  People can come in with their own materials and build whatever.  &lt;/p&gt;\n\n&lt;p&gt;The biggest liability is obviously the insurance/threat of lawsuits from such a dangerous fucking place that anyone can walk in.  Mitigation: some sort of safety class/basic operations certification before use?  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m just kind of spit balling here.  Would enjoy CONSTRUCTIVE input.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I don't see it as actually feasible but curious if anyone has actually seen a business model like this.  I'm thinking of using this idea for an MBA project next term but curious on input.\n\nBasic concept is I would own a work shop (wood and metal, maybe a mechanic's bay too?) and charge for time in the shop.  Have all the tools and machines and whatnot.  People can come in with their own materials and build whatever.  \n\nThe biggest liability is obviously the insurance/threat of lawsuits from such a dangerous fucking place that anyone can walk in.  Mitigation: some sort of safety class/basic operations certification before use?  \n\nI'm just kind of spit balling here.  Would enjoy CONSTRUCTIVE input.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1znthv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "CPTherptyderp", "media": null, "score": 8, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1znthv/has_anyone_ever_experimented_with_a_kind_of_rent/", "name": "t3_1znthv", "created": 1394084277.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1znthv/has_anyone_ever_experimented_with_a_kind_of_rent/", "author_flair_text": null, "title": "Has anyone ever experimented with a kind of \"rent a workshop\" business?", "created_utc": 1394055477.0, "ups": 8, "num_comments": 16, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So i&amp;#39;ve been a lurker for quite a while to this subreddit but now that i am close to my launch i want to seek out your advice. i will fill out your survey:&lt;/p&gt;\n\n&lt;p&gt;1) Active Road Trips: Our tours range from 5-28 days long. You travel in small groups of 6-12 like minded people who want to focus on healthy living &amp;amp; travel. You visit all the major cities &amp;amp; National Parks in North America. Your guide is a yoga instructor, personal trainer, chef or active guide. at the moment 3 types of trips: active, yoga and bootcamp&lt;/p&gt;\n\n&lt;p&gt;2) i have been working in this particular industry (road trip group style travel) for many years and in tourism for about 16 years now. it isn&amp;#39;t exactly the most healthy way to travel (lot of junk food and very little actual active activities) i always found myself at the end of every season going off to place like thailand and focusing on being active and being healthy. i grew tired of it and decided to combine the two! &lt;/p&gt;\n\n&lt;p&gt;3)  I&amp;#39;ve been working on this for a few years now. &lt;/p&gt;\n\n&lt;p&gt;4) rather long to type out here&lt;/p&gt;\n\n&lt;p&gt;5) positive is the fact that i have done a majority of this myself and its been fun watching it evolve. i am quite proud of it. negative is how long it has taken me. i blame a.d.d&lt;/p&gt;\n\n&lt;p&gt;6) keep at it! it will be worth it. you will make a difference in the way people travel. even if its just a few people! &lt;/p&gt;\n\n&lt;p&gt;today is actually the first time i have really started showing the website to most people. i have been keeping this rather close to the chest. now you will see that there is a still some changes left to do on it (put up real pics and some of the wording needs to be fixed or put on it)\n&lt;a href=\"http://activeroadtrips.com\"&gt;http://activeroadtrips.com&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;any advice, tips, criticism, help or anything you can offer would be great. thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So i've been a lurker for quite a while to this subreddit but now that i am close to my launch i want to seek out your advice. i will fill out your survey:\n\n1) Active Road Trips: Our tours range from 5-28 days long. You travel in small groups of 6-12 like minded people who want to focus on healthy living &amp; travel. You visit all the major cities &amp; National Parks in North America. Your guide is a yoga instructor, personal trainer, chef or active guide. at the moment 3 types of trips: active, yoga and bootcamp\n\n2) i have been working in this particular industry (road trip group style travel) for many years and in tourism for about 16 years now. it isn't exactly the most healthy way to travel (lot of junk food and very little actual active activities) i always found myself at the end of every season going off to place like thailand and focusing on being active and being healthy. i grew tired of it and decided to combine the two! \n\n3)  I've been working on this for a few years now. \n\n4) rather long to type out here\n\n5) positive is the fact that i have done a majority of this myself and its been fun watching it evolve. i am quite proud of it. negative is how long it has taken me. i blame a.d.d\n\n6) keep at it! it will be worth it. you will make a difference in the way people travel. even if its just a few people! \n\ntoday is actually the first time i have really started showing the website to most people. i have been keeping this rather close to the chest. now you will see that there is a still some changes left to do on it (put up real pics and some of the wording needs to be fixed or put on it)\nhttp://activeroadtrips.com \n\nany advice, tips, criticism, help or anything you can offer would be great. thanks!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1znv6k", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Befreeman", "media": null, "score": 6, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1znv6k/advice_on_my_startup_please/", "name": "t3_1znv6k", "created": 1394085199.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1znv6k/advice_on_my_startup_please/", "author_flair_text": null, "title": "Advice on my startup please!", "created_utc": 1394056399.0, "ups": 6, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Are there any chrome extensions that will record every navigation action, button click, and field filled out while I&amp;#39;m testing it? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Are there any chrome extensions that will record every navigation action, button click, and field filled out while I'm testing it? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1znf1b", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "kumarovski", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1znf1b/for_qa_web_app_testing_what_tools_do_you_use/", "name": "t3_1znf1b", "created": 1394076459.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1znf1b/for_qa_web_app_testing_what_tools_do_you_use/", "author_flair_text": null, "title": "For QA web app testing, what tools do you use?", "created_utc": 1394047659.0, "ups": 7, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://conversionxl.com/customer-lifetime-value/\"&gt;http://conversionxl.com/customer-lifetime-value/&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "http://conversionxl.com/customer-lifetime-value/", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zo74u", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ericosiu", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zo74u/how_to_calculate_and_increase_customer_lifetime/", "name": "t3_1zo74u", "created": 1394091829.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zo74u/how_to_calculate_and_increase_customer_lifetime/", "author_flair_text": null, "title": "How to calculate and increase customer lifetime value", "created_utc": 1394063029.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Occasionally I come across posts that mention mastermind groups. I am very curious.&lt;/p&gt;\n\n&lt;p&gt;What is the time commitment like? What is discussed? Are they worth seeking out?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Occasionally I come across posts that mention mastermind groups. I am very curious.\n\nWhat is the time commitment like? What is discussed? Are they worth seeking out?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zofsw", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "silang2", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zofsw/has_anyone_been_part_of_a_mastermind_group/", "name": "t3_1zofsw", "created": 1394097150.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zofsw/has_anyone_been_part_of_a_mastermind_group/", "author_flair_text": null, "title": "Has anyone been part of a \"mastermind\" group?", "created_utc": 1394068350.0, "ups": 2, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve got CAD done and a prototype created, but I don&amp;#39;t have the money to pay for patent lawyer fees. Is there any way to monetize without a patent? Is there a way to sell a design without a patent? Are there patent lawyers that will take equity as compensation? What would you do in my situation.&lt;/p&gt;\n\n&lt;p&gt;Thanks for your advice guys&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've got CAD done and a prototype created, but I don't have the money to pay for patent lawyer fees. Is there any way to monetize without a patent? Is there a way to sell a design without a patent? Are there patent lawyers that will take equity as compensation? What would you do in my situation.\n\nThanks for your advice guys\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1znqtd", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Walrustax", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1znqtd/got_designs_and_prototype_but_no_money_for_patent/", "name": "t3_1znqtd", "created": 1394082780.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1znqtd/got_designs_and_prototype_but_no_money_for_patent/", "author_flair_text": null, "title": "Got designs and prototype - but no money for patent. What do I do?", "created_utc": 1394053980.0, "ups": 4, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I posted this as &lt;a href=\"http://www.reddit.com/r/Entrepreneur/comments/1zim34/behind_the_scenes_of_the_launch_of_my_passive/cfu4033\"&gt;a question in a &amp;quot;success story&amp;quot; thread&lt;/a&gt; (which later turned out to be controversial), but never got an answer.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t understand how people keep setting up these eStores, get a good amount of revenue going, but claim they do little to no work. I&amp;#39;ve set up eStores for clients in the past, but by far, the most troublesome part was storing inventory and shipping it out.&lt;/p&gt;\n\n&lt;p&gt;How do you automate:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;product creation/acquisition&lt;/li&gt;\n&lt;li&gt;storage&lt;/li&gt;\n&lt;li&gt;delivery to customers&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;tl dr; When setting up an estore, how do you make the delivery process as passive as possible?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I posted this as [a question in a \"success story\" thread](http://www.reddit.com/r/Entrepreneur/comments/1zim34/behind_the_scenes_of_the_launch_of_my_passive/cfu4033) (which later turned out to be controversial), but never got an answer.\n\nI don't understand how people keep setting up these eStores, get a good amount of revenue going, but claim they do little to no work. I've set up eStores for clients in the past, but by far, the most troublesome part was storing inventory and shipping it out.\n\nHow do you automate:\n\n* product creation/acquisition\n* storage\n* delivery to customers\n\ntl dr; When setting up an estore, how do you make the delivery process as passive as possible?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zn3ya", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "rand486", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zn3ya/successful_rentrepreneur_estore_owners_how_are/", "name": "t3_1zn3ya", "created": 1394070218.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zn3ya/successful_rentrepreneur_estore_owners_how_are/", "author_flair_text": null, "title": "Successful /r/entrepreneur estore owners, how are you automating your estores?", "created_utc": 1394041418.0, "ups": 7, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just wondering if anyone would be up for doing some review swapping - google+ , yelp whatever...  I know reviews are super important in getting exposure on google local, so if anyone wants to swap some reviews, post a link to where you want the review - I&amp;#39;ll review it and post a link to mine and so on and so forth... &lt;/p&gt;\n\n&lt;p&gt;Thought this could be a good idea to help some people out - myself included - so hopefully this isnt breaking any rules! &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Just wondering if anyone would be up for doing some review swapping - google+ , yelp whatever...  I know reviews are super important in getting exposure on google local, so if anyone wants to swap some reviews, post a link to where you want the review - I'll review it and post a link to mine and so on and so forth... \n\nThought this could be a good idea to help some people out - myself included - so hopefully this isnt breaking any rules! ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zne2u", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "99Faces", "media": null, "score": 5, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 2, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zne2u/review_swap_thread/", "name": "t3_1zne2u", "created": 1394075912.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zne2u/review_swap_thread/", "author_flair_text": null, "title": "Review swap thread?", "created_utc": 1394047112.0, "ups": 7, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m on the team for a new startup called &lt;a href=\"http://www.opthub.com/\"&gt;OptHub&lt;/a&gt;. &lt;/p&gt;\n\n&lt;p&gt;OptHub is a mobile app that combines all the brand content that was before only accessible through different websites, emails, videos, and web channels. You can download the newest version on the app store or the old version (limited features, worse UI) is available for the android. &lt;/p&gt;\n\n&lt;p&gt;Perhaps the most powerful feature is OptHub’s ability to provide brand emails to consumers directly through the app. We’re the only company that allows consumers to search and explore content that was once only available to email subscribers. There’s no longer any need to subscribe to different newsletters and brand emails: we allow users to access newsletters and brand mail on a stunning user friendly  as our app plucks these emails up from the web and delivers them to you in a stunning user friendly way through the app. &lt;/p&gt;\n\n&lt;p&gt;You can read an overview of our company and more about our app&amp;#39;s capabilities on our blog &lt;a href=\"http://opthub.com/blog/introduction/\"&gt;here&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Earlier this year, we ran into the founder of reddit, Alexis Ohanian. He really liked our app and gave us some advice and a shout out on twitter: &lt;a href=\"http://imgur.com/v9jyMFH,PgBEKVJ#1\"&gt;here&lt;/a&gt; and &lt;a href=\"http://imgur.com/v9jyMFH,PgBEKVJ#0\"&gt;here&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re looking for feedback on the app now and our concept- is a hub for brand content something that you think consumers need? We&amp;#39;re trying to recreate how people consume content on the mobile platform (starting with brands, musicians, and entertainment). What do you think about our company? Any tips for approaching VCs?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm on the team for a new startup called [OptHub](http://www.opthub.com/). \n\nOptHub is a mobile app that combines all the brand content that was before only accessible through different websites, emails, videos, and web channels. You can download the newest version on the app store or the old version (limited features, worse UI) is available for the android. \n\nPerhaps the most powerful feature is OptHub’s ability to provide brand emails to consumers directly through the app. We’re the only company that allows consumers to search and explore content that was once only available to email subscribers. There’s no longer any need to subscribe to different newsletters and brand emails: we allow users to access newsletters and brand mail on a stunning user friendly  as our app plucks these emails up from the web and delivers them to you in a stunning user friendly way through the app. \n\nYou can read an overview of our company and more about our app's capabilities on our blog [here](http://opthub.com/blog/introduction/)\n\nEarlier this year, we ran into the founder of reddit, Alexis Ohanian. He really liked our app and gave us some advice and a shout out on twitter: [here](http://imgur.com/v9jyMFH,PgBEKVJ#1) and [here](http://imgur.com/v9jyMFH,PgBEKVJ#0)\n\nWe're looking for feedback on the app now and our concept- is a hub for brand content something that you think consumers need? We're trying to recreate how people consume content on the mobile platform (starting with brands, musicians, and entertainment). What do you think about our company? Any tips for approaching VCs?\n\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zo5cx", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thomastullis", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zo5cx/working_with_a_new_mobile_app_startup_were/", "name": "t3_1zo5cx", "created": 1394090800.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zo5cx/working_with_a_new_mobile_app_startup_were/", "author_flair_text": null, "title": "Working with a new mobile app startup: we're looking for some feedback and advice on where to go from here!", "created_utc": 1394062000.0, "ups": 3, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious as to what you see as an immediate hurdle to getting started. I&amp;#39;ll be fully transparent and say your answers would help inform my own product, which aims to help early stage entrepreneurs get things done faster, but I&amp;#39;m not going to tell you what that product is or who I am - I participate on Reddit anon for that reason.&lt;/p&gt;\n\n&lt;p&gt;And, of course, if you have something you&amp;#39;re facing that someone else or I can help with, all the better. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm curious as to what you see as an immediate hurdle to getting started. I'll be fully transparent and say your answers would help inform my own product, which aims to help early stage entrepreneurs get things done faster, but I'm not going to tell you what that product is or who I am - I participate on Reddit anon for that reason.\n\nAnd, of course, if you have something you're facing that someone else or I can help with, all the better. ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zopr9", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "hon3ybadg3r", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zopr9/solo_tech_wannarepreneurs_whats_your_biggest/", "name": "t3_1zopr9", "created": 1394103510.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zopr9/solo_tech_wannarepreneurs_whats_your_biggest/", "author_flair_text": null, "title": "Solo tech wannarepreneurs, what's your biggest immediate hurdle?", "created_utc": 1394074710.0, "ups": 1, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, I want to incorporate a business soon, I have 2 investors to which I offered 35% of the company. However, the thing is I am not investing any money as I&amp;#39;ve already spent quite a bit in pre-launch expenses. My question is I will hold 65% of the company without contributing to the share capital. So how do I go about it when I do the company formation?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi, I want to incorporate a business soon, I have 2 investors to which I offered 35% of the company. However, the thing is I am not investing any money as I've already spent quite a bit in pre-launch expenses. My question is I will hold 65% of the company without contributing to the share capital. So how do I go about it when I do the company formation?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zncmi", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "moussif", "media": null, "score": 4, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zncmi/need_help_in_regards_to_share_structure_can_share/", "name": "t3_1zncmi", "created": 1394075125.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zncmi/need_help_in_regards_to_share_structure_can_share/", "author_flair_text": null, "title": "Need help in regards to share structure. Can share capital be anything at registration?", "created_utc": 1394046325.0, "ups": 5, "num_comments": 2, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://buff.ly/1gSSIEP\"&gt;Make Your Linkedin Profile Standout With YouTube&lt;/a&gt; &lt;/p&gt;\n\n&lt;p&gt;YouTube is the second leading internet search engine, behind Google, and responsible for the entertainment and education of the entire planet. That said, it is important for a brand to have a YouTube presence and to execute upon their YouTube strategy. However, YouTube can be used for more than just making your brand stand-out; it can easily make you stand-out by seamlessly integrating into your LinkedIn profile.&lt;/p&gt;\n\n&lt;p&gt;Every person, in every industry, is fighting tooth-and-nail to make themselves heard above the noise that exists online, ensuring their relevance (or dominance) in their boss’, peers’, and clients’ eyes. Given the rise of accessibility, the old adage “work smarter, not harder” could not hold more weight. Fortunately LinkedIn has some incredible tools, of which most aren’t even aware.&lt;/p&gt;\n\n&lt;p&gt;Integrating a video into your profile page is as simple as a few keystrokes . Within the “edit your profile” tab, there is the option to upload images, documents and video (by the way if you don’t have video we’ll cover that below).&lt;/p&gt;\n\n&lt;p&gt;Copy and paste your YouTube URLs  of your (or your company’s) how-to videos, branded content, interviews, etc. This creates a playlist of videos that are immediately available for reference upon reaching your LinkedIn profile.&lt;/p&gt;\n\n&lt;p&gt;Now, what do you do if you don’t have video content, but still want to establish yourself as an industry expert? Create it. Okay, that’s oversimplifying, so here’s the bonus takeaway on how to get interviewed by YouTube channels with an audience or to interview an influencer in the industry.&lt;/p&gt;\n\n&lt;p&gt;On YouTube you’ll want to search your brand’s SEO term with the keywords “interview with”. So let’s say you are the social media marketer for your company or your company is the hot, new social media measurement tool. You’ll want to enter the search on YouTube like so:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;social media marketing&amp;quot; + &amp;quot;Interview With&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This yields a list of both interviewers and interviewees. From here, reach out to whichever makes the most sense for your needs. The interviewee is doing the same thing as the rest of us, working to get out front and maintain their position as a thought leader. The interviewer is operating like a blog - hungry for content. Sell them on why you’re a thought leader or how your company can help them generate additional views by being a topic (you have a large twitter following or known blog, etc.). Wash. Rinse. Repeat.&lt;/p&gt;\n\n&lt;p&gt;Now if you want your next employer to notice you or to make yourself known as an industry leader among the professional community, you are well on your way to having a catalog of relevant video content at their disposal.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "[Make Your Linkedin Profile Standout With YouTube](http://buff.ly/1gSSIEP) \n\nYouTube is the second leading internet search engine, behind Google, and responsible for the entertainment and education of the entire planet. That said, it is important for a brand to have a YouTube presence and to execute upon their YouTube strategy. However, YouTube can be used for more than just making your brand stand-out; it can easily make you stand-out by seamlessly integrating into your LinkedIn profile.\n\nEvery person, in every industry, is fighting tooth-and-nail to make themselves heard above the noise that exists online, ensuring their relevance (or dominance) in their boss’, peers’, and clients’ eyes. Given the rise of accessibility, the old adage “work smarter, not harder” could not hold more weight. Fortunately LinkedIn has some incredible tools, of which most aren’t even aware.\n\nIntegrating a video into your profile page is as simple as a few keystrokes . Within the “edit your profile” tab, there is the option to upload images, documents and video (by the way if you don’t have video we’ll cover that below).\n\nCopy and paste your YouTube URLs  of your (or your company’s) how-to videos, branded content, interviews, etc. This creates a playlist of videos that are immediately available for reference upon reaching your LinkedIn profile.\n\nNow, what do you do if you don’t have video content, but still want to establish yourself as an industry expert? Create it. Okay, that’s oversimplifying, so here’s the bonus takeaway on how to get interviewed by YouTube channels with an audience or to interview an influencer in the industry.\n\nOn YouTube you’ll want to search your brand’s SEO term with the keywords “interview with”. So let’s say you are the social media marketer for your company or your company is the hot, new social media measurement tool. You’ll want to enter the search on YouTube like so:\n\n\"social media marketing\" + \"Interview With\"\n\nThis yields a list of both interviewers and interviewees. From here, reach out to whichever makes the most sense for your needs. The interviewee is doing the same thing as the rest of us, working to get out front and maintain their position as a thought leader. The interviewer is operating like a blog - hungry for content. Sell them on why you’re a thought leader or how your company can help them generate additional views by being a topic (you have a large twitter following or known blog, etc.). Wash. Rinse. Repeat.\n\nNow if you want your next employer to notice you or to make yourself known as an industry leader among the professional community, you are well on your way to having a catalog of relevant video content at their disposal.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zoliu", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "markwi11is", "media": null, "score": 2, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zoliu/growth_hacking_your_linkedin_profile_through/", "name": "t3_1zoliu", "created": 1394100717.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zoliu/growth_hacking_your_linkedin_profile_through/", "author_flair_text": null, "title": "Growth Hacking Your Linkedin Profile Through YouTube", "created_utc": 1394071917.0, "ups": 2, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have read posts from this thread talking about partnerships with individuals in the Philippines, Tiawan, etc who do basic data-entry and administration tasks for well below US minimum wage. How would go about finding these workers? Is it normally done through a service, elance.com, eharmony? I need some simple data mining and work done in fluent English and I am not sure where to start.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have read posts from this thread talking about partnerships with individuals in the Philippines, Tiawan, etc who do basic data-entry and administration tasks for well below US minimum wage. How would go about finding these workers? Is it normally done through a service, elance.com, eharmony? I need some simple data mining and work done in fluent English and I am not sure where to start.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1znxjn", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "thethreeredditeers", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1znxjn/how_to_find_international_labor_for/", "name": "t3_1znxjn", "created": 1394086478.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1znxjn/how_to_find_international_labor_for/", "author_flair_text": null, "title": "How to find international labor for data-entry/administration work?", "created_utc": 1394057678.0, "ups": 3, "num_comments": 6, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really don&amp;#39;t want to dash her hopes on this. She&amp;#39;s running a business (I don&amp;#39;t want to give information on what aspect, please) and it&amp;#39;s really starting to weigh heavily on her.  I&amp;#39;ve been keeping her motivated and inspired to go on, and to focus and stay on track.&lt;/p&gt;\n\n&lt;p&gt;This is her first business venture, and I&amp;#39;m sure that there are a lot of people here who have felt like her, in her shoes.&lt;/p&gt;\n\n&lt;p&gt;How did you get through it?  What aspect did you focus most on, and what were the small details you left aside to make the right choices? How long will this phase of self-doubt last?  When is too much &lt;em&gt;too much&lt;/em&gt;?&lt;/p&gt;\n\n&lt;p&gt;Serious answers please, and I beg of you to stay away from the &amp;quot;She should quit now&amp;quot; replies; I&amp;#39;m looking for the best ways to help someone, and I know there&amp;#39;s great answers from all of you.&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I really don't want to dash her hopes on this. She's running a business (I don't want to give information on what aspect, please) and it's really starting to weigh heavily on her.  I've been keeping her motivated and inspired to go on, and to focus and stay on track.\n\nThis is her first business venture, and I'm sure that there are a lot of people here who have felt like her, in her shoes.\n\nHow did you get through it?  What aspect did you focus most on, and what were the small details you left aside to make the right choices? How long will this phase of self-doubt last?  When is too much *too much*?\n\nSerious answers please, and I beg of you to stay away from the \"She should quit now\" replies; I'm looking for the best ways to help someone, and I know there's great answers from all of you.\n\nThanks in advance.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zok4e", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "tethercat", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zok4e/advice_please_a_friend_has_started_a_business_and/", "name": "t3_1zok4e", "created": 1394099868.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zok4e/advice_please_a_friend_has_started_a_business_and/", "author_flair_text": null, "title": "Advice, please. A friend has started a business and is getting overwhelmed. Soft suggestions for a first-timer?", "created_utc": 1394071068.0, "ups": 1, "num_comments": 3, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am interested in taking my medical device concept to the prototype stage and further development but I need experts in hardware development. Has anyone heard of or used &lt;a href=\"http://www.minnetronix.com/\"&gt;http://www.minnetronix.com/&lt;/a&gt; for this purpose?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I am interested in taking my medical device concept to the prototype stage and further development but I need experts in hardware development. Has anyone heard of or used http://www.minnetronix.com/ for this purpose?", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zojp5", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "davraj", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zojp5/experience_with_minnetronix/", "name": "t3_1zojp5", "created": 1394099591.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zojp5/experience_with_minnetronix/", "author_flair_text": null, "title": "Experience with Minnetronix?", "created_utc": 1394070791.0, "ups": 1, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey all, first post here. Let me start out by saying I have no established company yet, it is all just an idea. That being said, along with reference materials I am reading over I was hoping you guys could critique my thinking and idea to see if what I am thinking of doing is even worth investing in. Also, I am not looking for a handout or to be annoying, so I will try not to seem &amp;quot;needy&amp;quot;. That being said...&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;IDEA:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is a fairly technical subject, so I will try to explain it as simply as possible. The company idea is to create, sell, and install vehicle Engine Control Units (ECU&amp;#39;s) and Data Loggers. The focus would be on the motorsports (both professional and amature) as well as aftermarket/vehicle modification crowd. &lt;/p&gt;\n\n&lt;p&gt;An ECU is basically the central brain that controls the engine. In layman&amp;#39;s term, it is a specialized computer. Data Loggers are just what they sound like, specialized computers for gathering a bunch of sensor data coupled with powerful software to analyze said data. &lt;/p&gt;\n\n&lt;p&gt;So, in short, as a company we would have to produce both hardware and software, both of which being very complex.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;REASONING:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I just graduated college a year ago this May as a MechE. Combining my work with racing vehicles, both in college and on an internship, I have about 3-4 years of experience (gathering more at my current job). I have two other friends, one working in the actual aftermarket ECU industry right now, that are interested, along with another EE friend that would love to do software design/co-create a company. And yes, I have read up about starting a company with friends and have been putting thought into that. &lt;/p&gt;\n\n&lt;p&gt;In thinking of what to start a company about, this is the industry I know. I feel like I have a grasp on the product and quality needed, as well as the functionality needed. &lt;/p&gt;\n\n&lt;p&gt;Personally, I actually have a pretty cushy job with a huge automotive OEM that I feel like I should be really happy with. But it feels like I am just happy with what it provides (living in LA with decent money) and not for what I do. I want to create something, lead something, and well I am sure most of you know what I am getting at.&lt;/p&gt;\n\n&lt;p&gt;It is worth noting I have decent student loans right now, one of the reasons for holding back at the moment. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;WORK DONE SO FAR:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;MARKET:&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;First thing I did was to try to figure out the current size of the market. This was really hard since all companies are private, but through places like manta I think I at least have an idea (even if some data is pretty old). What I have come up with is the top three companies average around $10-30 million/yr in revenue each, with the smallest company making around $250k (they honestly make a crap product with little marketing, not surprised). So just looking at revenue, market cap would be around $60-100 million/year. &lt;/p&gt;\n\n&lt;p&gt;This is where I get a little stuck as to what to do next. Questions are at the end.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;PRODUCT:&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I have started a spider-graph layout to detail all input/output/calculations needed for the ECU in order to get an idea of the logic and programming needed. From there, I figure I would work on hardware needs, then actual software design. This is where it gets to the point that I think an actual business would need to be started.&lt;/p&gt;\n\n&lt;p&gt;I am also working on getting as much data as possible about the current products, and use that to estimate the needs for our product to at least be competitive (and price point). Then from there try to find a way to be &amp;quot;different&amp;quot; or innovate in order to stand apart. &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;CONCERNS:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;This is not an easy market to get into like, say, a mobile app (not knocking the work needed to make a mobile app through!). The large companies I mentioned above have 10&amp;#39;s of years of experience with this industry. Initial capital would be small for a prototype, but large for final design and production (Full circuit board with many intricate components, very intricate software needs to be developed, tons of reliability testing needed, etc.).&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;QUESTIONS:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;1) My first question is about how to actually work on the project. Basically, at what point must you be committed to making a company full time? For example, it is reasonable for us to get to a prototype stage while keeping a full time job? Or is that kind of a method just bound to make the company fail because of the less time I can dedicate? &lt;/p&gt;\n\n&lt;p&gt;2) Does anyone here have experience trying to enter an already fairly mature market with big players? How does it compare to, say, entering a new and upcoming tech market? Is it going to be harder or just different?&lt;/p&gt;\n\n&lt;p&gt;3) In terms of market research - I assume I need to predict how I can penetrate said market, then try to estimate future revenue, correct? Then use that to try to get a handle on what is acceptable for future expenses? Perhaps just recommending good material to read would be helpful here haha.&lt;/p&gt;\n\n&lt;p&gt;4) To make an end product, we would need more than 2-3 people working on it (software alone would need 2-3 programmers). Any advice on trying to recruit people? Resources I could read to try to understand the employee gathering process for a startup? &lt;/p&gt;\n\n&lt;p&gt;I am sure I have many more questions, but I feel like this is too long as is. Basically I just need to see if I am on the right track at all, and if this idea isn&amp;#39;t totally crazy. Perhaps I just need to write it all out to help me think better, and this is it haha. &lt;/p&gt;\n\n&lt;p&gt;Thank you for any help you can provide :).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey all, first post here. Let me start out by saying I have no established company yet, it is all just an idea. That being said, along with reference materials I am reading over I was hoping you guys could critique my thinking and idea to see if what I am thinking of doing is even worth investing in. Also, I am not looking for a handout or to be annoying, so I will try not to seem \"needy\". That being said...\n\n\n\n\n**IDEA:**\n\n\nThis is a fairly technical subject, so I will try to explain it as simply as possible. The company idea is to create, sell, and install vehicle Engine Control Units (ECU's) and Data Loggers. The focus would be on the motorsports (both professional and amature) as well as aftermarket/vehicle modification crowd. \n\nAn ECU is basically the central brain that controls the engine. In layman's term, it is a specialized computer. Data Loggers are just what they sound like, specialized computers for gathering a bunch of sensor data coupled with powerful software to analyze said data. \n\nSo, in short, as a company we would have to produce both hardware and software, both of which being very complex.\n\n\n\n\n**REASONING:**\n\n\nI just graduated college a year ago this May as a MechE. Combining my work with racing vehicles, both in college and on an internship, I have about 3-4 years of experience (gathering more at my current job). I have two other friends, one working in the actual aftermarket ECU industry right now, that are interested, along with another EE friend that would love to do software design/co-create a company. And yes, I have read up about starting a company with friends and have been putting thought into that. \n\nIn thinking of what to start a company about, this is the industry I know. I feel like I have a grasp on the product and quality needed, as well as the functionality needed. \n\nPersonally, I actually have a pretty cushy job with a huge automotive OEM that I feel like I should be really happy with. But it feels like I am just happy with what it provides (living in LA with decent money) and not for what I do. I want to create something, lead something, and well I am sure most of you know what I am getting at.\n\nIt is worth noting I have decent student loans right now, one of the reasons for holding back at the moment. \n\n\n\n\n**WORK DONE SO FAR:**\n\n\n*MARKET:*\n\n\nFirst thing I did was to try to figure out the current size of the market. This was really hard since all companies are private, but through places like manta I think I at least have an idea (even if some data is pretty old). What I have come up with is the top three companies average around $10-30 million/yr in revenue each, with the smallest company making around $250k (they honestly make a crap product with little marketing, not surprised). So just looking at revenue, market cap would be around $60-100 million/year. \n\nThis is where I get a little stuck as to what to do next. Questions are at the end.\n\n\n*PRODUCT:*\n\n\nI have started a spider-graph layout to detail all input/output/calculations needed for the ECU in order to get an idea of the logic and programming needed. From there, I figure I would work on hardware needs, then actual software design. This is where it gets to the point that I think an actual business would need to be started.\n\nI am also working on getting as much data as possible about the current products, and use that to estimate the needs for our product to at least be competitive (and price point). Then from there try to find a way to be \"different\" or innovate in order to stand apart. \n\n\n\n\n**CONCERNS:**\n\n\nThis is not an easy market to get into like, say, a mobile app (not knocking the work needed to make a mobile app through!). The large companies I mentioned above have 10's of years of experience with this industry. Initial capital would be small for a prototype, but large for final design and production (Full circuit board with many intricate components, very intricate software needs to be developed, tons of reliability testing needed, etc.).\n\n\n\n\n\n\n**QUESTIONS:**\n\n\n1) My first question is about how to actually work on the project. Basically, at what point must you be committed to making a company full time? For example, it is reasonable for us to get to a prototype stage while keeping a full time job? Or is that kind of a method just bound to make the company fail because of the less time I can dedicate? \n\n\n2) Does anyone here have experience trying to enter an already fairly mature market with big players? How does it compare to, say, entering a new and upcoming tech market? Is it going to be harder or just different?\n\n\n3) In terms of market research - I assume I need to predict how I can penetrate said market, then try to estimate future revenue, correct? Then use that to try to get a handle on what is acceptable for future expenses? Perhaps just recommending good material to read would be helpful here haha.\n\n\n4) To make an end product, we would need more than 2-3 people working on it (software alone would need 2-3 programmers). Any advice on trying to recruit people? Resources I could read to try to understand the employee gathering process for a startup? \n\n\n\n\n\n\n\n\nI am sure I have many more questions, but I feel like this is too long as is. Basically I just need to see if I am on the right track at all, and if this idea isn't totally crazy. Perhaps I just need to write it all out to help me think better, and this is it haha. \n\n\nThank you for any help you can provide :).\n\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zohui", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "cardriverx", "media": null, "score": 1, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": 1394070072.0, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zohui/advice_needed_about_entering_an_established/", "name": "t3_1zohui", "created": 1394098447.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zohui/advice_needed_about_entering_an_established/", "author_flair_text": null, "title": "Advice needed about entering an established market needing a complicated device, and critiques on my line of thinking so far would be appreciated!", "created_utc": 1394069647.0, "ups": 1, "num_comments": 0, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey all,&lt;/p&gt;\n\n&lt;p&gt;I made an Obama novelty item and am hoping it will go viral in GOP circles. It really is innovative and first of it&amp;#39;s kind, and i have received nothing but positive feedback from everyone I&amp;#39;ve shown it to.  I have a good personal network and am confident it&amp;#39;ll sell.  Still, it&amp;#39;s a risk, but its too late to change and I believe in the product.  &lt;/p&gt;\n\n&lt;p&gt;Having said that, I am approaching a few bumps in the road and could use some of your expertise on these issues.&lt;/p&gt;\n\n&lt;p&gt;It is a single product which i have developed completely alone, and it has artistic qualities as well.  Basically a game, nothing crazy just cards with text and pictures I made.&lt;/p&gt;\n\n&lt;p&gt;a. Can I sell a product like this without having set up a corporation?  Can I just sell these to the public without anything else legally?  Do I need a fictitious business name or a LLC for any reason?&lt;/p&gt;\n\n&lt;p&gt;b. I plan on shipping through a fulfillment company like amazon, but until I increase my orders, I will be doing it myself.  Does anyone have experience shipping small items through the mail, and if so, which way did you end up shipping?&lt;/p&gt;\n\n&lt;p&gt;Thanks in advance for any comments&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey all,\n\nI made an Obama novelty item and am hoping it will go viral in GOP circles. It really is innovative and first of it's kind, and i have received nothing but positive feedback from everyone I've shown it to.  I have a good personal network and am confident it'll sell.  Still, it's a risk, but its too late to change and I believe in the product.  \n\nHaving said that, I am approaching a few bumps in the road and could use some of your expertise on these issues.\n\nIt is a single product which i have developed completely alone, and it has artistic qualities as well.  Basically a game, nothing crazy just cards with text and pictures I made.\n\na. Can I sell a product like this without having set up a corporation?  Can I just sell these to the public without anything else legally?  Do I need a fictitious business name or a LLC for any reason?\n\nb. I plan on shipping through a fulfillment company like amazon, but until I increase my orders, I will be doing it myself.  Does anyone have experience shipping small items through the mail, and if so, which way did you end up shipping?\n\nThanks in advance for any comments", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1znng2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "undefeated", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1znng2/launching_single_product_direct_to_the_public/", "name": "t3_1znng2", "created": 1394080981.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1znng2/launching_single_product_direct_to_the_public/", "author_flair_text": null, "title": "Launching single product direct to the public soon, need insight!", "created_utc": 1394052181.0, "ups": 3, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys,\nI am starting up a web shop where I will dropship gourmet juices. I am right now in the progress of talking to the specific company that is located in the UK (I live in Norway) and I need your help.\nThis is my first entreprenurish trip and I just want to hear if you guys have any tips or ideas that I could use?\nTo minimum the amount of time (and making me a middle hand) I will forward the customers orders on my web shop to this company which imports the juice from Asia and send it to the customers in Norway.\nTherefore I will not have any stock in my house (storage problem solved) nor risk any investments (but the web page and time). The only cons I&amp;#39;ve thought of is that I will obviously become indepedent of the company that I am dropshipping from. If they run out of stock, so do I, but that&amp;#39;s how dropshipping works.\nThe company also has a web site and sells to primarly the UK and then the rest of Europe and the World.\nThe gourmet juices I will primarly begin to sell are just a few different sorts and I will take it from there.\nWhat would you recommend me to do? Am I missing something? Should I start up the web site?\nThanks a lot! Jonathan&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey guys,\nI am starting up a web shop where I will dropship gourmet juices. I am right now in the progress of talking to the specific company that is located in the UK (I live in Norway) and I need your help.\nThis is my first entreprenurish trip and I just want to hear if you guys have any tips or ideas that I could use?\nTo minimum the amount of time (and making me a middle hand) I will forward the customers orders on my web shop to this company which imports the juice from Asia and send it to the customers in Norway.\nTherefore I will not have any stock in my house (storage problem solved) nor risk any investments (but the web page and time). The only cons I've thought of is that I will obviously become indepedent of the company that I am dropshipping from. If they run out of stock, so do I, but that's how dropshipping works.\nThe company also has a web site and sells to primarly the UK and then the rest of Europe and the World.\nThe gourmet juices I will primarly begin to sell are just a few different sorts and I will take it from there.\nWhat would you recommend me to do? Am I missing something? Should I start up the web site?\nThanks a lot! Jonathan", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zmhcv", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "Balderz", "media": null, "score": 7, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 1, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zmhcv/dropshipping_gourmet_juice_would_need_help_from/", "name": "t3_1zmhcv", "created": 1394055545.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zmhcv/dropshipping_gourmet_juice_would_need_help_from/", "author_flair_text": null, "title": "Dropshipping Gourmet Juice, would need help from experienced :)", "created_utc": 1394026745.0, "ups": 8, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve developed a system where I handle a business&amp;#39;s gift certificates. My service allows a company to easily add a link to their site to sell GC&amp;#39;s online and sell them in store using a computer or smart phone, and allows a customer to redeem the GC in store or online. I feel great about the product, but now that I&amp;#39;m trying to launch I can&amp;#39;t decide on how to price it.&lt;/p&gt;\n\n&lt;p&gt;Entrepreneurs who&amp;#39;ve done a service in anyway related to this, what seems reasonable to charge? Small business owners (my target market), what would you pay for a service like this?&lt;/p&gt;\n\n&lt;p&gt;1.) What sort of rate structure? &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Percentage of each GC sold?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Flat fee per GC?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Monthly plan?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Combination of these?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;2.) What actual prices/percentages within that structure?&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;1% of GC amount? 10% of GC amount?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;10 cents a card? $1 a card?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;$50 a month? $500 a month?&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I think you get my point. I&amp;#39;m totally lost as to what my product is worth. There are infinite possiblities. My costs are negligible since I&amp;#39;m running this off a server already hosting other sites.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve heard rumors that services like Groupon take 50% of revenue. That&amp;#39;s insane. I&amp;#39;m not aiming for anything like that, but I just have no clue. Thanks for any help you can offer!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've developed a system where I handle a business's gift certificates. My service allows a company to easily add a link to their site to sell GC's online and sell them in store using a computer or smart phone, and allows a customer to redeem the GC in store or online. I feel great about the product, but now that I'm trying to launch I can't decide on how to price it.\n\nEntrepreneurs who've done a service in anyway related to this, what seems reasonable to charge? Small business owners (my target market), what would you pay for a service like this?\n\n1.) What sort of rate structure? \n\n- Percentage of each GC sold?\n\n- Flat fee per GC?\n\n- Monthly plan?\n\n- Combination of these?\n\n2.) What actual prices/percentages within that structure?\n\n- 1% of GC amount? 10% of GC amount?\n\n- 10 cents a card? $1 a card?\n\n- $50 a month? $500 a month?\n\nI think you get my point. I'm totally lost as to what my product is worth. There are infinite possiblities. My costs are negligible since I'm running this off a server already hosting other sites.\n\nI've heard rumors that services like Groupon take 50% of revenue. That's insane. I'm not aiming for anything like that, but I just have no clue. Thanks for any help you can offer!", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zn5gq", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "PistolMcDaniels", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zn5gq/third_party_gift_certificate_processing_rate/", "name": "t3_1zn5gq", "created": 1394071077.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zn5gq/third_party_gift_certificate_processing_rate/", "author_flair_text": null, "title": "Third party gift certificate processing rate structures", "created_utc": 1394042277.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What are some good blogs that provide great info and tips for Ecommerce. Looking to learn about increasing conversion rates, layout, email marketing etc..&lt;/p&gt;\n\n&lt;p&gt;Any info that will be helpful when running a Ecommerce website.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What are some good blogs that provide great info and tips for Ecommerce. Looking to learn about increasing conversion rates, layout, email marketing etc..\n\n\nAny info that will be helpful when running a Ecommerce website.", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zlzlf", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "bizman21", "media": null, "score": 18, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 4, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zlzlf/ecommerce_blogs/", "name": "t3_1zlzlf", "created": 1394034847.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zlzlf/ecommerce_blogs/", "author_flair_text": null, "title": "Ecommerce Blogs", "created_utc": 1394006047.0, "ups": 22, "num_comments": 8, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi &lt;a href=\"/r/entrepreneur\"&gt;/r/entrepreneur&lt;/a&gt;!&lt;/p&gt;\n\n&lt;p&gt;A buddy and I are starting a cute little ecommerce site as a side project for something we love. We&amp;#39;ve got the site, we&amp;#39;re meeting with a lawyer for our LLC and operating agreement, and we&amp;#39;ve filed for an EIN.&lt;/p&gt;\n\n&lt;p&gt;Now we need to choose a place to do our business checking. I&amp;#39;d personally prefer a credit union local to Austin or San Antonio, but I&amp;#39;m not opposed to an online-entirely shop. &lt;/p&gt;\n\n&lt;p&gt;Anybody have any rants and raves about small business checking? Lowest fees? Best services? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi /r/entrepreneur!\n\nA buddy and I are starting a cute little ecommerce site as a side project for something we love. We've got the site, we're meeting with a lawyer for our LLC and operating agreement, and we've filed for an EIN.\n\nNow we need to choose a place to do our business checking. I'd personally prefer a credit union local to Austin or San Antonio, but I'm not opposed to an online-entirely shop. \n\nAnybody have any rants and raves about small business checking? Lowest fees? Best services? ", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zn3wt", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "kishi", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zn3wt/banking_services_for_small_business_rants_and/", "name": "t3_1zn3wt", "created": 1394070192.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zn3wt/banking_services_for_small_business_rants_and/", "author_flair_text": null, "title": "Banking services for small business -- rants and raves.", "created_utc": 1394041392.0, "ups": 3, "num_comments": 1, "visited": false, "num_reports": null, "distinguished": null}}, {"kind": "t3", "data": {"domain": "self.Entrepreneur", "banned_by": null, "media_embed": {}, "subreddit": "Entrepreneur", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey fellow entrepreneurs.&lt;/p&gt;\n\n&lt;p&gt;I was supposed to launch my retail shop by early March but because there where some extra meetings that the guys where I&amp;#39;m launching needed we got 2 weeks behind, then it was supposed to be launched by the 24 of March but today  spoke to the guys people where I&amp;#39;m gonna launch and they told me that it&amp;#39;s better if we could launch by the 1st of April...&lt;/p&gt;\n\n&lt;p&gt;Damn this is making me so anxious I have everything ready. And I have been working a lot the last months for this business to work, but now I have NOTHiNG to do just wait...and this is killing me. My mind is constantly wondering: &amp;quot;Is this going to work&amp;quot;, &amp;quot;maybe I should re think X or Y thing&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;What do you guys recommend me to do...I&amp;#39;m currently doing lots of running; some reading but I find myself bored and anxious.&lt;/p&gt;\n\n&lt;p&gt;BTW, the retail business is focused on natural and healthy snacks.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hey fellow entrepreneurs.\n\nI was supposed to launch my retail shop by early March but because there where some extra meetings that the guys where I'm launching needed we got 2 weeks behind, then it was supposed to be launched by the 24 of March but today  spoke to the guys people where I'm gonna launch and they told me that it's better if we could launch by the 1st of April...\n\nDamn this is making me so anxious I have everything ready. And I have been working a lot the last months for this business to work, but now I have NOTHiNG to do just wait...and this is killing me. My mind is constantly wondering: \"Is this going to work\", \"maybe I should re think X or Y thing\".\n\nWhat do you guys recommend me to do...I'm currently doing lots of running; some reading but I find myself bored and anxious.\n\nBTW, the retail business is focused on natural and healthy snacks.\n", "likes": null, "secure_media": null, "link_flair_text": null, "id": "1zn3h2", "gilded": 0, "secure_media_embed": {}, "clicked": false, "stickied": false, "author": "ultrapreneruship", "media": null, "score": 3, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "self", "subreddit_id": "t5_2qldo", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "saved": false, "is_self": true, "permalink": "/r/Entrepreneur/comments/1zn3h2/anxiety_over_9000_soon_going_to_open_my_retail/", "name": "t3_1zn3h2", "created": 1394069956.0, "url": "http://www.reddit.com/r/Entrepreneur/comments/1zn3h2/anxiety_over_9000_soon_going_to_open_my_retail/", "author_flair_text": null, "title": "Anxiety over 9000!!! Soon going to open my retail business, but the wait is killing me. What do you recommend to use time efficiently and not feel like a scumbag :(", "created_utc": 1394041156.0, "ups": 3, "num_comments": 7, "visited": false, "num_reports": null, "distinguished": null}}], "after": "t3_1zn3h2", "before": null}}